//: [Previous](@previous)

import Foundation

//Структуры
//Не могут наследоваться, являются типом значение - отличия от класса

//В структурах можно:

//Объявлять свойства для хранения значений
//Объявлять методы, чтобы обеспечить функциональность
//Объявлять индексы, чтобы обеспечить доступ к их значениям, через синтаксис индексов
//Объявлять инициализаторы, чтобы установить их первоначальное состояние
//могут быть расширены, чтобы расширить их функционал за пределами стандартной реализации
//могут соответствовать протоколам, для обеспечения стандартной функциональности определенного типа


//struct SomeStructure {
//    // здесь пишется определение структуры
//}

//=== - оператор тождественности, определяет принадлежат ли экземпляры класса к одной ячейки памяти
