//: [Previous](@previous)

import Foundation

//Оператор — это специальный символ или выражение для проверки, изменения или сложения величин



//    = оператор присваивания


//Арифметические операторы

//    + сложение
//    - вычетание
//    * умножение
//    / деление
//    % оператор остатка


//Cоставные операторы

//    += (сокращенная запись а = а + б// а += б)
//    -= (сокращенная запись а = а - б// а -= б)


//Логические операторы

//    ! не
//    || или
//    && и


//Операторы сравнения

//    != неравно
//    == сравнение
//    > больше
//    < меньше
//    >= больше или равно
//    <= меньше или равно


//Оператороы диапазона

//    1...10 диапазон 1-10(последнее число входит, оператор замкнутого диапазона)
//    1..<10 диапазон 1-10(последнее число не входит, оператор полузамкнутого диапазона)
//    [2...] диапазон 2 - последний индекс (односторонние деапазоны)
//    ~= принадлежит ли число даипазону


//Тернарный оператор(применяются к трем величинам)

//    let а = bool ? 10 : 30 //если условие выполняется то первое значение, если нет - второе (true = 10/ false = 30)


//Унарный оператор(применяются к одной величине)

//    - (оператор унарного минуса)
//    + (оператор унарного плюса)


//Оператор опционального значения

//    ?? - nil
//    Пример: let myName = name ?? defaultName - если есть значение то ок, если нет то присваивается дефолтное значение

